Revit 2026 API

# FabricationHostedInfoGetBearerCenterline Method

---

Gets the centerline of the bearer. The method is applicable only for bearer hanger.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Line GetBearerCenterline()
```
```vb
Public Function GetBearerCenterline As Line
```
```cpp
public:
Line^ GetBearerCenterline()
```
```fsharp
member GetBearerCenterline : unit -> Line
```

#### Return Value

Line The centerline of the bearer.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The hanger is not a bearer hanger. |

#### Reference

FabricationHostedInfo Class

Autodesk.Revit.DB Namespace